app/controllers/alionamods_controller.rb

     def index
    @aliona = Alionamod.all
---
SELECT "alionamods".* FROM "alionamods"