app/controllers/dianas_controller.rb

  def index
    @diana = Diana.all
---
SELECT "dianas".* FROM "dianas"