app/controllers/lizas_controller.rb

  def index
    @liza = Liza.all
---
SELECT "lizas".* FROM "lizas"