app/controllers/nastiamods_controller.rb

   def index
    @nastia = Nastiamod.all
---
SELECT "nastiamods".* FROM "nastiamods"