app/controllers/teas_controller.rb

SELECT "teas".* FROM "teas"
---
  def index
    @teas = Tea.all

INSERT INTO "teas" ("name", "description", "color", "price", "link_to_pic", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @tea = Tea.new(tea_params)
    @tea.save

UPDATE "teas" SET "link_to_pic" = ?, "updated_at" = ? WHERE "teas"."id" = ?  [["link_to_pic", "http://www.chay.info/upload/iblock/729/729c421be68d95bdcf10df481b8543e6.jpg"], ["updated_at", "2017-07-16 22:11:06.944590"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @tea.update(tea_params)

SELECT  "teas".* FROM "teas" WHERE "teas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_tea
      @tea = Tea.find(params[:id])